app/Models/ModelKategori.php

SELECT *
FROM `tb_kategori`
---
    public function alldata()
    {
        return $this->db->table('tb_kategori')->get()->getResultArray();

INSERT INTO `tb_kategori` (`nama_kategori`) VALUES ('Minuman')
---
    public function insertdata($data)
    {
        $this->db->table('tb_kategori')->insert($data);

DELETE FROM `tb_kategori`
WHERE `id_kategori` = '3'
AND `id_kategori` = '3'
---
    public function deletedata($data)
    {
        $this->db->table('tb_kategori')
            ->where('id_kategori', $data['id_kategori'])
            ->delete($data);