app/Models/Modelproduk.php

SELECT *
FROM `tb_produk`
JOIN `tb_kategori` ON `tb_kategori`.`id_kategori`=`tb_produk`.`id_kategori`
JOIN `tb_satuan` ON `tb_satuan`.`id_satuan`=`tb_produk`.`id_satuan`
ORDER BY `id_produk` DESC
---
    public function AllData()
    {
        return $this->db->table('tb_produk')
            ->join('tb_kategori', 'tb_kategori.id_kategori=tb_produk.id_kategori')
            ->join('tb_satuan', 'tb_satuan.id_satuan=tb_produk.id_satuan')
            ->orderBy('id_produk', 'DESC')
            ->get()
            ->getResultArray();

INSERT INTO `tb_produk` (`kode_produk`, `nama_produk`, `id_kategori`, `id_satuan`, `harga_jual`, `harga_beli`, `stok`) VALUES ('122115', 'bayam', '1', '3', '120000', '109000', '10')
---
    public function insertdata($data)
    {
        $this->db->table('tb_produk')->insert($data);

DELETE FROM `tb_produk`
WHERE `id_produk` = '4'
AND `id_produk` = '4'
---
    public function deletedata($data)
    {
        $this->db->table('tb_produk')
            ->where('id_produk', $data['id_produk'])
            ->delete($data);