app/Models/ModelUser.php

    public function AllData()
    {
        return $this->db->table('tb_user')->get()->getResultArray();
---
SELECT *
FROM `tb_user`

    public function insertdata($data)
    {
        $this->db->table('tb_user')->insert($data);
---
INSERT INTO `tb_user` (`nama_user`, `email`, `password`, `level`) VALUES ('12341234', NULL, 'da39a3ee5e6b4b0d3255bfef95601890afd80709', '2')

    public function updatedata($data)
    {
        $this->db->table('tb_user')
            ->where('id_user', $data['id_user'])
            ->update($data);
---
UPDATE `tb_user` SET `id_user` = '3', `nama_user` = 'adit', `email` = 'adit@gmail.com', `password` = 'c129b324aee662b04eccf68babba85851346dff9', `level` = '1'
WHERE `id_user` = '3'

    public function deletedata($data)
    {
        $this->db->table('tb_user')
            ->where('id_user', $data['id_user'])
            ->delete($data);
---
DELETE FROM `tb_user`
WHERE `id_user` = '4'
AND `id_user` = '4'