app/Models/Modelsatuan.php

SELECT *
FROM `tb_satuan`
---
    public function alldata()
    {
        return $this->db->table('tb_satuan')->get()->getResultArray();

UPDATE `tb_satuan` SET `id_satuan` = '9', `nama_satuan` = 'dd'
WHERE `id_satuan` = '9'
---
    public function updatedata($data)
    {
        $this->db->table('tb_satuan')
            ->where('id_satuan', $data['id_satuan'])
            ->update($data);

DELETE FROM `tb_satuan`
WHERE `id_satuan` = '8'
AND `id_satuan` = '8'
---
    public function deletedata($data)
    {
        $this->db->table('tb_satuan')
            ->where('id_satuan', $data['id_satuan'])
            ->delete($data);